{"Aatrox": "Top/Jungle, mid-game oriented, AD, attackspeed, bruiser/assassin tank, frontline, tip: don't be afraid to play aggressive if you know your passive is up in a team fight.",
"Ahri": "Mid, mid to late-game oriented, AP, assassin, backline, tip: always try to engage with E to guarantee that the rest of your spells will land.",
"Akali": "Mid/top/jungle, mid to late-game oriented, backline, AP/hybrid, burst, assassin, important combos: Q, R, AA, E.",
"Alistar": "Support, mid-game oriented, AP, supportive, tank, frontline, important combos: W, Q for a low-cooldown Malphite ultimate.",
"Amumu": "Jungle, late-game oriented, AP, frontline, tank, supportive, tip: use q to engage, flash if necessary, and ult as much of the enemy team as possible, tip: try to be in their face as much as you can if you're building tank. Don't be afraid to ult single champions early game.",
"Anivia": "Mid, late-game oriented, burst, AP, backline, important combos: Q, E or R, E.",
"Annie": "Mid, mid/late-game, AP burst caster, mage, engage with stun-ready r, engage/backline positioning. When laning, you can abuse your kill potential with Q into R and W. Also, when using Q, if you have your stun up before the animation lands, it will count as a stun.",
"Ashe": "ADC, mid to late-game oriented, AD, attackspeed, ranged, backline, tip: engage with R for your team or if you are dueling.",
"AurelionSol": "Mid, mid to late-game oriented, AP, DPS but capable of big burst, roam-heavy, backline/supportive, improtant combos: Q, E.",
"Azir": "Mid, late-game oriented, AP, DPS, backline, important combos: Q, E, R.",
"Bard": "Support, early to mid-game oriented, roam-heavy, AP, backline/initiator/supportive, tip: Bard poke is very strong early game in lane, utilize it.",
"Blitzcrank": "Support, early to late-game oriented, AP, initiator/supportive, important combos: Q, E, R.",
"Brand": "Mid/support, AP, burst, backline/supportive, important combos: E, Q, W for stun combo or Q, E, W, for waveclear, tip: if you are about to die, always use your ult to help get off as much damage as possible before dying.",
"Braum": "Support/Tank, CC-Heavy. Use Q to engage and slow, and then jump to somebody (W) and use your wall (E) to block projectiles and other stuff.",
"Caitlyn": "Bot, AD, attackspeed, backline, place traps in between AA's, important combos: E, Q, AA",
"Camille": "Top/jungle, AD, assassin, bruiser, tip: you can burst down the enemy carries very quickly and ensure that they cannot escape with your ultimate.",
"Cassiopeia": "Mid, AP, DPS, backline positioning, important combos: Q, E, E, pro tip: you can't buy boots.",
"Chogath": "Mid, jungle, top, AP, tank, burst, frontline, mid to late-game oriented, caution: very easily kitable! Important combos: Q, W, R.",
"Corki": "Mid, ADC, AD, caster, weave autos between abilities, poke with Q and R, package every 5 minutes is strong for teamfights, but stay backline",
"Darius": "Top, AD, tank, Frontline, you can all in at level 1, extended fights work in your favor",
"Diana": "Mid, AP, backline/assassin, Q - R allows you to cast R again",
"DrMundo": "Top/jungle, AD, tank, frontline, late-game oriented, tip: Mundo, Mundo!",
"Draven": "Bot, ADC, AD, attack speed, mid to late-game oriented, backline, tip: have your team play around you when you have a lot of stacks so that you can get a kill and cash in.",
"Ekko": "Top/mid/jungle, AP, bruiser/assassin, mid to late-game oriented, tip: don't be afraid to dive deep into the backline for the enemy carries if your ultimate is off cooldown.",
"Elise": "Jungle, AP, tank, early to mid-game oriented, supportive/assassin positioning, combo (from human) W, E, Q, R, W, Q, use human E to catch out enemies, spider E to gap close/escape.",
"Evelynn": "Jungle, AP/hybrid, assassin, burst-heavy, early to mid-game oriented, tip: gank aggressively as your passive prevents you from being seen until it is too late.",
"Ezreal": "Mid/ADC, backline, mid to late-game oriented, AD/AP, poke-heavy, tip: stacking your passive will help you win trades and fights.",
"FiddleSticks": "Jungle/mid/support, AP, assassin, tip: use fog of war to get a good ultimate.",
"Fiora": "Top, AD, bruiser/assassin, mid to late-game oriented, tip: always trade when you can pop a mark with your Q on the enemy.",
"Fizz": "Mid, AP, assassin, burst, backline, tip: your E makes you invulnerable to damage and CC, use it at the right opportunity to gain the most benefit.",
"Galio": "Mid, AP, supportive positioning, use W flash R to get multi person taunt without taking too much damage, strong against AP teams since you get bonus AP from MR.",
"Gangplank": "Top, AD, supportive positioning, triple barrel combo - place down first barrel, then second barrel, Q first barrel and then place third barrel",
"Garen": "Top, frontline, mid to late-game oriented, AD, bruiser, tank, important combos: Q, E.",
"Gnar": "Top, frontline, early to mid-game oriented, AD, bruiser, tank, important combo in mega Gnar: R, W, Q, E.",
"Gragas": "Top/jungle, frontline/initiator, mid to late-game oriented, AP, tank, important combo: E, flash, to cover a large distance with little to no counterplay.",
"Graves": "Jungle, AD, backline, mid to late game oriented, reload mechanic and AOE autoattacks, use E to reload one shot.",
"Hecarim": "Top/jungle, frontline, mid to late-game oriented, AD, bruiser, tip: your ultimate makes causes enemies to run in the opposite direction of where you are, combos: E, R, E enemy in desired direction, W, Q.",
"Heimerdinger": "Top/mid, backline/split pusher, AP, CDR, burst, tip: always place turrets behind you or near you to cover your retreat; keep pathing around your turrets and let them deal damage if you are ganked, important combos: E, R to W.",
"Illaoi": "Top, AD, bruiser/tank, mid to late-game oriented, frontline, don't be afraid to dive deep to get a good ultimate since you'll heal more from more tentacles.",
"Irelia": "Top, AD, attackspeed, bruiser/assassin, mid to late-game oriented, tip: always use your Q on minions with low health to close the gap for trades to keep your Q off cooldown.",
"Ivern": "Jungle/support, tank/supportive, CC-heavy, tip: place bushes up for your team when your team is taking objectives like dragon or baron.",
"Janna": "Support, backline, AP, movespeed, ultimate peel champ for an ADC.",
"JarvanIV": "Mid/top/jungle, frontline/assassin, AD, burst, bruiser, save ultimate for people who you know don't have flash so that they cannot escape, important combos: E, Q, AA, R.",
"Jax": "Top/jungle, frontline/assassin, split-push heavy, bruiser, attackspeed, post-6 combo E AA (Q if needed) AA W AA",
"Jayce": "Top/mid, strong early to mid-game, AD, burst, assassin, poke-heavy, important combo in cannon mode: Q then E in front of the missile; W in cannon form and then Q, W, AA, AA, AA, E.",
"Jhin": "AD Marksman, AD crit + attackspeed, strong early to mid-game. W ability will root enemies if they are marked by your or teammate's abilities; good way to combo somebody is to slow them with trap, stun (trap counts as mark), Q into R from long range. R shouldn't be used in close range engage.",
"Jinx": "ADC, AD, attackspeed, backline, mid to late-game oriented, tips: use rocket mode for range, more damage, or if you are in a teamfight; use mini-gun when pumping out DPS and when fighting single targets.",
"Kalista": "ADC, AD, attackspeed, backline, kite-heavy, use E to smite objectives.",
"Karma": "Mid/support, AP, Utility, supportive/backline positioning, use R E in teamfights, R W to regain health.",
"Karthus": "Mid, AP, caster, backline/assassin positioning, tip: don't be afraid to die.",
"Kassadin": "Mid, AP, burst, backline/assassin positioning, tip: pre 6 you are very weak.",
"Katarina": "Mid, AP, backline/assassin, tip: place your daggers to maximize mobility.",
"Kayle": "Top/jungle, AP, attackspeed, late-game hypercarry, tip: keep farming to reach your late game power spike as fast as possible.",
"Kennen": "Top/mid, AP, tank, frontline, mid to late-game oriented, teamfight combo: flash, R protobelt, W, zhonyas.",
"Khazix": "Jungle/top, AD, bruiser/assassin, assassin positioning, combo: E, AA, Q, AA, W, R, AA, R, AA.",
"Kindred": "Jungle, AD, marksman, backline positioning, late-game oriented, tip: keep farming marks for late game.",
"Kled": "Top, AD, bruiser, tank, frontline positioning, use ult to engage teamfights, trade when your W is up.",
"KogMaw": "Mid/Marksman, AD/AP, attackspeed, strong early to mid, and super late game. As a mid laner, you'll be super weak to all-ins until level 6; in fact, since you have no escape except flash, you'll be super weak in general. Make sure you abuse your long-range poke with R; E is main damage dealer.",
"Leblanc": "Mid, AP, assassin, burst, backline/assassin positioning, when to use ults: Q more damage, W for mobility, E for CC.",
"LeeSin": "Jungle/Top, AD, assassin, early to mid-game oriented, important combos: R, Q, Q; Q, R, Q. Tip: Keep up passive auto ability by cycling abilities roughly every 2 autoattacks. Multiple ways to kick enemies backwards: 1. Q into flash, R; 2. Q into ward into W, R; 3. Ward into W, R; 4. Flash, R.",
"Leona": "Support, AD, tank, frontline, mid to late-game oriented, initiator, important combo: W, E, Q.",
"Lissandra": "Mid/top, AP, backline/assassin, strong roam/gank potential, mid to late-game oriented, initiator.",
"Lucian": "ADC, backline, AD, attackspeed, mid-game oriented, tip: if there are no good positions available in a teamfight, use your ultimate for long range DPS.",
"Lulu": "Top/mid/support, AP, backline/supportive, mid-game oriented, tip: always speed up your ADC if you can to help them kite.",
"Lux": "Mid/support, AP, burst, mid to late-game oriented, backline, important combo: Q, E, R to instantly burst people.",
"Malphite": "Top, AP, frontline, initiator, bruiser, mid to late-game oriented, tip: stack armor.",
"Malzahar": "Mid, AP, off-tank, backline, mid to late-game oriented, important combo: R.",
"Maokai": "Top, AP, bruiser, frontline, mid to late-game oriented, important combo: E, W, Q.",
"MasterYi": "Jungle, AD, attackspeed, assassin, mid to late-game oriented, save your Q to dodge important cc or gap close, your W can reset your AA and negate dmg, very vulnerable to CC.",
"MissFortune": "ADC/support, AD, attackspeed, mid to late-game oriented, poke-heavy, backline tip: positioning is key on Miss Fortune since she doesn't have any escapes.",
"Mordekaiser": "Top, AP, tank, bruiser, tip: stack up for your Q and then flash in for the unexpected damage; always use your ultimate on dragon to get an extra tank on your team.",
"Morgana": "Mid/support, AP, backline/supportive, poke-heavy, important combo: Q, W.",
"Nami": "Support, AP, backline/supportive, Nami is very squishy so never find yourself in the midst of a fight.",
"Nasus": "Top, AD, CDR, tank, frontline, late-game oriented, very easily kitable, tip: save your wither (W) for the enemy ADC in a team fight.",
"Nautilus": "Top/jungle/support, mid to late-game oriented, frontline, bruiser, AP.",
"Nidalee": "Jungle/mid, AP, assassin, backline/assassin, combo (from human): W, Q, R, W, AA, Q, AA, E.",
"Nocturne": "Jungle, mid-game oriented, AD/attackspeed, bruiser, assassin, important combos: R, Q (mid-air), E, W.",
"Nunu": "Top/jungle, frontline/tank/supportive, AP, bruiser, tip: make sure to utilize Nunu's kit by taking early dragons/barons/rift heralds.",
"Olaf": "Top/jungle, early to mid-game oriented, AD, bruiser, frontline, tip: make sure to always catch your axes for maximum DPS.",
"Orianna": "Mid, AP, CDR, backline, mid to late-game oriented, important combos: Q, W, R.",
"Pantheon": "Top/jg, AD, bruiser, assassin, early to mid-game oriented, utilize your ultimate for ganks/dives/or simply getting back to lane, important combos: Q, W, E.",
"Poppy": "Top/jungle, AD, bruiser, tank, mid to late-game oriented, tip: ulting some enemies away in a fight can give you an advantage.",
"Quinn": "Jungle/top/ADC, AD, attackspeed, assassin, backline, tip: use ultimate to move around faster and to flank.",
"Rammus": "Jungle, AP, Tank, frontline, combo: Q, R, E, W, tip: scales well with armor, strong against AD teams.",
"RekSai": "Jungle, AD, bruiser, tank, frontline, combo (from buried): Q, E, W, AA, Q, AA, AA, E, AA.",
"Renekton": "Top, AD, bruiser, early to mid-game oriented, frontline, make sure to always use enraged W for maximum damage and enraged Q for maximum healing, important combos: E, W, AA, Q, E.",
"Rengar": "Jungle/top, AD, assassin, bruiser, assassin positioning, use different empowered abilities based on the situation.",
"Riven": "Top/jg/mid, AD, bruiser, assassin, mid to late-game oriented, important combos: E and R together; Q, AA, Q, AA, Q, AA, W; E and W together.",
"Rumble": "Top/mid, AP, tank, frontline/supportive positioning, try to use your spells so that you overheat right after your combo while your spells are on cooldown, at level 1 prep your heat bar by using Q before minions spawn, a good ult can equalize a bad fight.",
"Ryze": "Mid, AP, Late game oriented. Strong waveclear, to waveclear use E to kill minion and spread, then Q to hit all of the minions; or E into one minion, E again to spread the mark, and Q to kill. E into W will extend root duration, E into Q will increase overload damage. Any ability will reset Q cooldown, and using two non-Q abilities and then using Q will give movement speed and shield.",
"Sejuani": "Bruiser/Tank Jungler, strong mid-game and super late game. Use Q to dash in and out of fights, also as a knockup; W is your main source of damage, allows for your E to do damage as well. Don't miss your R.",
"Shaco": "Jungle/top, AD/AP, assassin, if jungling try to invade to disrupt enemy jungler, place boxes strategically so enemies will fear into a direction or into another box.",
"Shen": "Top/jungle, AD, tank, frontline/supportive positioning, stay aware of your allies so you can ult to them (can use champion portraits), combo: E, W, Q, AA, AA.",
"Shyvana": "Jungle, late-game oriented, frontline, AD, attackspeed, tip: land your E before fighting for maximum DPS.",
"Singed": "Top/jungle, late-game oriented, frontline, AP, tank, important combos: Q (just keep it on forever late game), W, E, Ctrl+4.",
"Sion": "Top/jungle, AD, tank, cc-heavy, frontline, can use your ult to engage a teamfight, important combos: R, W, Q, (Q pop to stun), (W pop) AA, E, AA.",
"Sivir": "ADC, AD, attackspeed, backline, mid to late-game oriented, tip: save your spell shield for enemy CC; use your ultimate to help your team initiate or retreat.",
"Skarner": "Jungle, late-game oriented, AD, tank, attackspeed, movespeed, frontline/initiator, tip: near the end of your ult duration, turn your character model around to move your target an even further distance.",
"Sona": "Support, early-game oriented, poke-heavy, backline/supportive, AP.",
"Soraka": "Support, early to mid-game oriented, backline/supportive, AP, CDR, tip: heal your allies… it helps.",
"Swain": "Top/mid, AP, tank, DPS, frontline/supportive positioning, tip: you'll still heal from your ult while in zhonyas.",
"Syndra": "Farm to 6, don't die. Then press R to end game.",
"TahmKench": "Support/top, AP, tank, frontline/supportive positioning, tip: nom nom nom.",
"Taliyah": "Mid, AP, caster, backline, combo: E, W, Q, tip: use your ultimate to cut off the retreat of the enemy or to help your team disengage.",
"Talon": "Mid, AD, assassin, assassin positioning, important combos: R, Q, AA, (tiamat/hyrda proc), AA, W, AA, Q.",
"Taric": "Support, tank, utility, frontline, use your bonded ally to maximize the impact of your abilities.",
"Teemo": "Top, AP, attackspeed, bruiser/assassin/split pusher, early to mid-game oriented, tip: make sure to place shrooms in areas that the enemy are likely to path.",
"Thresh": "Support, initiator/supportive, tank, movespeed, tip: you can hook to jungle minions to make an escape.",
"Tristana": "ADC, late-game oriented, backline, AD, attackspeed, tip: Tristana has the highest range out of any champion during late game; use this to your positioning advantage.",
"Trundle": "Top/jungle, AD, tank, frontline, important combo: Ctr + 3.",
"Tryndamere": "Top/jungle, mid to late-game hypercarry, AD, attackspeed, assassin/split pusher, no specific combo.",
"TwistedFate": "Mid, mid to late-game oriented, AP, CDR, movespeed, backline, important combos: W (gold card), Q, repeat.",
"Twitch": "ADC/jungle, late-game hypercarry, AD, attackspeed, backline, no specific combo.",
"Udyr": "Jungle/top, AD, attackspeed, bruiser/tank, frontline, splitpush heavy.",
"Urgot": "The God needs no description.(E + Q Combo)",
"Varus": "ADC/mid, mid to late-game oriented, backline, poke-heavy, AD, tip: utilize your passive for maximum dps.",
"Vayne": "Top/ADC, late-game oriented, backline, AD, attackspeed, tip: use your ultimate's invisibility on your Q to help you position in team fights.",
"Veigar": "Mid, AP, burst, tip: stack Q, farm to 6, press R to end game.",
"Velkoz": "Mid/support, AP, backline positioning, tip: get an A in geometry before playing him.",
"Vi": "Jungle, mid to late-game oriented, AD, bruiser/assassin, tip: always save ult for enemy carries because it is impossible to escape.",
"Viktor": "Mid, AP, backline positioning, tip: use your Q for move speed to help position yourself better.",
"Vladimir": "Mid/top, AP, tank, frontline positioning, tip: don't be afraid to dive in deep if you hit a good ultimate you'll be healing a lot.",
"Volibear": "Jungle/top, AD, tank, frontline positioning, tip: farm early and don't be afraid to pop your passive in the jungle early-game.",
"Warwick": "Jungle, AD, attackspeed, mid to late-game oriented, assassin, important combos: R, Q.",
"MonkeyKing": "Top/jungle, AD, bruiser. mid to late-game oriented, combo: E, Q, W to safety, frontline/assassin.",
"Xerath": "Mid/support, AP, maximum dps combo: E, W, Q, tip: utilize passive to stay in lane and keep poking, mid to late-game oriented, backline.",
"XinZhao": "Top/jungle, AD, attackspeed, bruiser, assassin, important combo: W, Q, E. Tip: Be careful with positioning and engaging, Xin Zhao has little to no way of escaping.",
"Yasuo": "Top/mid, AD, bruiser, assassin, backline/assassin positioning, tip: always fight near minion waves so that you can dash through them for better positioning.",
"Yorick": "Top/jungle, AD, tank, frontline, splitpush heavy.",
"Zac": "Jungle, AP, tank, frontline, mid to late-game oriented, important combos: E, W, Q, R.",
"Zed": "Mid, AD, assassin, backline/assassin positioning, trade combo: W, E, Q.",
"Ziggs": "Mid, AP, caster, backline positioning, tip: it's harder to hit spells than it looks.",
"Zilean": "Mid/support, AP, utility, backline positioning, tip: can't killean the zilean.",
"Zyra": "Mid/support, AP, engage with E. Very strong lvl 6 and mid-game, tip: utilize plants for maximum dmg, supportive and capable of high burst."}
